<template>
  <ve-histogram :data="chartData"/>
</template>

<script>
export default {
  data() {
    return {
      chartData: {
        columns: ['月度', '投标数', '中标数', '中标率'],
        rows: [
          { 月度: '1月', 投标数: 1393, 中标数: 1093, 中标率: 0.32 },
          { 月度: '2月', 投标数: 3530, 中标数: 3230, 中标率: 0.26 },
          { 月度: '3月', 投标数: 2923, 中标数: 2623, 中标率: 0.76 },
          { 月度: '4月', 投标数: 1723, 中标数: 1423, 中标率: 0.49 },
          { 月度: '5月', 投标数: 3792, 中标数: 3492, 中标率: 0.32 },
          { 月度: '6月', 投标数: 4593, 中标数: 4293, 中标率: 0.78 }
        ]
      }
    }
  }
}
</script>
