<template>
  <ve-histogram :data="chartData"/>
</template>

<script>
export default {
  data() {
    return {
      chartData: {
        columns: ['月度', '投标数', '中标数', '中标率'],
        rows: [
          { 月度: '1月', 投标数: 3, 中标数: 0, 中标率: 0 },
          { 月度: '2月', 投标数: 4, 中标数: 1, 中标率: 0.25 },
          { 月度: '3月', 投标数: 3, 中标数: 1, 中标率: 0.33 },
          { 月度: '4月', 投标数: 4, 中标数: 0, 中标率: 0 },
          { 月度: '5月', 投标数: 5, 中标数: 1, 中标率: 0.2 },
          { 月度: '6月', 投标数: 3, 中标数: 0, 中标率: 0 }
        ]
      }
    }
  }
}
</script>
